In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [3]:
titanic = pd.read_csv("https://raw.githubusercontent.com/pandas-dev/pandas/main/doc/data/titanic.csv")
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [4]:
titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [5]:
titanic['Name']

0                                Braund, Mr. Owen Harris
1      Cumings, Mrs. John Bradley (Florence Briggs Th...
2                                 Heikkinen, Miss. Laina
3           Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                               Allen, Mr. William Henry
                             ...
886                                Montvila, Rev. Juozas
887                         Graham, Miss. Margaret Edith
888             Johnston, Miss. Catherine Helen "Carrie"
889                                Behr, Mr. Karl Howell
890                                  Dooley, Mr. Patrick
Name: Name, Length: 891, dtype: object

In [6]:
titanic.Name.str.lower()

0                                braund, mr. owen harris
1      cumings, mrs. john bradley (florence briggs th...
2                                 heikkinen, miss. laina
3           futrelle, mrs. jacques heath (lily may peel)
4                               allen, mr. william henry
                             ...
886                                montvila, rev. juozas
887                         graham, miss. margaret edith
888             johnston, miss. catherine helen "carrie"
889                                behr, mr. karl howell
890                                  dooley, mr. patrick
Name: Name, Length: 891, dtype: object

In [7]:
titanic.Name.str.upper()

0                                BRAUND, MR. OWEN HARRIS
1      CUMINGS, MRS. JOHN BRADLEY (FLORENCE BRIGGS TH...
2                                 HEIKKINEN, MISS. LAINA
3           FUTRELLE, MRS. JACQUES HEATH (LILY MAY PEEL)
4                               ALLEN, MR. WILLIAM HENRY
                             ...
886                                MONTVILA, REV. JUOZAS
887                         GRAHAM, MISS. MARGARET EDITH
888             JOHNSTON, MISS. CATHERINE HELEN "CARRIE"
889                                BEHR, MR. KARL HOWELL
890                                  DOOLEY, MR. PATRICK
Name: Name, Length: 891, dtype: object

In [8]:
titanic.Name.str.title()

0                                Braund, Mr. Owen Harris
1      Cumings, Mrs. John Bradley (Florence Briggs Th...
2                                 Heikkinen, Miss. Laina
3           Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                               Allen, Mr. William Henry
                             ...
886                                Montvila, Rev. Juozas
887                         Graham, Miss. Margaret Edith
888             Johnston, Miss. Catherine Helen "Carrie"
889                                Behr, Mr. Karl Howell
890                                  Dooley, Mr. Patrick
Name: Name, Length: 891, dtype: object

In [10]:
titanic["Name"].str.split(",")

0                             [Braund,  Mr. Owen Harris]
1      [Cumings,  Mrs. John Bradley (Florence Briggs ...
2                              [Heikkinen,  Miss. Laina]
3        [Futrelle,  Mrs. Jacques Heath (Lily May Peel)]
4                            [Allen,  Mr. William Henry]
                             ...
886                             [Montvila,  Rev. Juozas]
887                      [Graham,  Miss. Margaret Edith]
888          [Johnston,  Miss. Catherine Helen "Carrie"]
889                             [Behr,  Mr. Karl Howell]
890                               [Dooley,  Mr. Patrick]
Name: Name, Length: 891, dtype: object

In [11]:
"pakistan, india, usa, japan"

'pakistan, india, usa, japan'

In [12]:
"pakistan, india, usa, japan".split(",")

['pakistan', ' india', ' usa', ' japan']

In [16]:
titanic["Surname"] = titanic["Name"].str.split(",").str.get(0)
titanic["Surname"]

0         Braund
1        Cumings
2      Heikkinen
3       Futrelle
4          Allen
         ...
886     Montvila
887       Graham
888     Johnston
889         Behr
890       Dooley
Name: Surname, Length: 891, dtype: object

In [17]:
titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Surname
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,Braund
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,Cumings
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,Heikkinen
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,Futrelle
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,Allen

In [19]:
titanic.Name.str.contains("Countess").sum()

1

In [20]:
titanic.Name.str.contains("Countess")

0      False
1      False
2      False
3      False
4      False
       ...
886    False
887    False
888    False
889    False
890    False
Name: Name, Length: 891, dtype: bool

In [21]:
titanic[titanic.Name.str.contains("Countess")]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Surname
759,760,1,1,"Rothes, the Countess. of (Lucy Noel Martha Dye...",female,33.0,0,0,110152,86.5,B77,S,Rothes

In [22]:
titanic.Name.str.len()

0      23
1      51
2      22
3      44
4      24
       ..
886    21
887    28
888    40
889    21
890    19
Name: Name, Length: 891, dtype: int64

In [24]:
print(titanic.Name.str.len().max())
print(titanic.Name.str.len().min())

82
12

In [27]:
titanic[titanic.Name.str.len() == 82]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Surname
307,308,1,1,"Penasco y Castellana, Mrs. Victor de Satode (M...",female,17.0,1,0,PC 17758,108.9,C65,C,Penasco y Castellana

In [28]:
titanic[titanic.Name.str.len() == 12]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Surname
692,693,1,3,"Lam, Mr. Ali",male,NaN,0,0,1601,56.4958,NaN,S,Lam
826,827,0,3,"Lam, Mr. Len",male,NaN,0,0,1601,56.4958,NaN,S,Lam

In [30]:
titanic["Name"].str.len().idxmax()

307

In [31]:
titanic["Name"].str.len().idxmin()

692

In [32]:
titanic.loc[titanic["Name"].str.len().idxmax(), "Name"]

'Penasco y Castellana, Mrs. Victor de Satode (Maria Josefa Perez de Soto y Vallejo)'

In [34]:
titanic["Sex"]

0        male
1      female
2      female
3      female
4        male
        ...
886      male
887    female
888    female
889      male
890      male
Name: Sex, Length: 891, dtype: object

In [33]:
titanic["Sex"].replace({"male": "M", "female": "F"})

0      M
1      F
2      F
3      F
4      M
      ..
886    M
887    F
888    F
889    M
890    M
Name: Sex, Length: 891, dtype: object

In [35]:
titanic["Sex"].map({"male": "M", "female": "F"})

0      M
1      F
2      F
3      F
4      M
      ..
886    M
887    F
888    F
889    M
890    M
Name: Sex, Length: 891, dtype: object

In [36]:
titanic.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked', 'Surname'],
      dtype='object')

In [37]:
titanic["Sex_short"] = titanic["Sex"].replace({"male": "M", "female": "F"})

In [38]:
titanic.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked', 'Surname', 'Sex_short'],
      dtype='object')

In [39]:
titanic.head(1)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Surname,Sex_short
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.25,NaN,S,Braund,M

# apply

In [50]:
def my_fun(x):

    x = x[0].upper() + x[1:-1].lower() + x[-1].upper()
    return x

my_fun("Pakistan Zinda bad")

'Pakistan zinda baD'

In [51]:
titanic.Name.apply(my_fun)

0                                Braund, mr. owen harriS
1      Cumings, mrs. john bradley (florence briggs th...
2                                 Heikkinen, miss. lainA
3           Futrelle, mrs. jacques heath (lily may peel)
4                               Allen, mr. william henrY
                             ...
886                                Montvila, rev. juozaS
887                         Graham, miss. margaret editH
888             Johnston, miss. catherine helen "carrie"
889                                Behr, mr. karl howelL
890                                  Dooley, mr. patricK
Name: Name, Length: 891, dtype: object

In [58]:
df = pd.DataFrame({
    "roll":[1,2,3,4,5,6,7,8,9,10],
    'name':list('ABCDEFGHIJ'),
    'sub1':np.random.randint(1,100, 10),
    'sub2':np.random.randint(1,100, 10),
    'sub3':np.random.randint(1,100, 10),
    'sub4':np.random.randint(1,100, 10),
    'sub5':np.random.randint(1,100, 10),
})
df

   roll name  sub1  sub2  sub3  sub4  sub5
0     1    A    94    20    70    30    91
1     2    B     8    72     1     5     8
2     3    C    46    95    68    67    48
3     4    D    56    11     4    16     1
4     5    E    85    46    21    75    44
5     6    F    86    68    78    99    56
6     7    G    53    44    35    58    53
7     8    H    38     8    85    39    62
8     9    I    87    40     5    44    91
9    10    J    92    41    40    11    51

In [59]:
df['total'] = df['sub1'] +  df['sub2'] +  df['sub3'] +  df['sub4'] + df['sub5']
df

   roll name  sub1  sub2  sub3  sub4  sub5  total
0     1    A    94    20    70    30    91    305
1     2    B     8    72     1     5     8     94
2     3    C    46    95    68    67    48    324
3     4    D    56    11     4    16     1     88
4     5    E    85    46    21    75    44    271
5     6    F    86    68    78    99    56    387
6     7    G    53    44    35    58    53    243
7     8    H    38     8    85    39    62    232
8     9    I    87    40     5    44    91    267
9    10    J    92    41    40    11    51    235

In [60]:
df[["sub1","sub2","sub3","sub4","sub5"]].apply(len)

sub1    10
sub2    10
sub3    10
sub4    10
sub5    10
dtype: int64

In [61]:
df[["sub1","sub2","sub3","sub4","sub5"]].apply(len, axis=1)

0    5
1    5
2    5
3    5
4    5
5    5
6    5
7    5
8    5
9    5
dtype: int64

In [63]:
df['toatl1'] = df[["sub1","sub2","sub3","sub4","sub5"]].apply(sum, axis=1)
df

   roll name  sub1  sub2  sub3  sub4  sub5  total  toatl1
0     1    A    94    20    70    30    91    305     305
1     2    B     8    72     1     5     8     94      94
2     3    C    46    95    68    67    48    324     324
3     4    D    56    11     4    16     1     88      88
4     5    E    85    46    21    75    44    271     271
5     6    F    86    68    78    99    56    387     387
6     7    G    53    44    35    58    53    243     243
7     8    H    38     8    85    39    62    232     232
8     9    I    87    40     5    44    91    267     267
9    10    J    92    41    40    11    51    235     235

In [70]:
df[["sub1","sub2","sub3","sub4","sub5"]].apply(np.mean, axis=1)

0    61.0
1    18.8
2    64.8
3    17.6
4    54.2
5    77.4
6    48.6
7    46.4
8    53.4
9    47.0
dtype: float64

In [64]:
def my_sum(s1,s2,s3,s4,s5):
    return s1 + s2 + s3 + s4 + s5

df['toatl1'] = df[["sub1","sub2","sub3","sub4","sub5"]].apply(my_sum, axis=1)
df

TypeError: my_sum() missing 4 required positional arguments: 's2', 's3', 's4', and 's5'

In [66]:
s1,s2,s3 = (1,2,3)
print(s1,s2,s3)

1 2 3

In [69]:
df['toatl1'] = df[["sub1","sub2","sub3","sub4","sub5"]].apply(lambda x:my_sum(*x), axis=1)
df

   roll name  sub1  sub2  sub3  sub4  sub5  total  toatl1
0     1    A    94    20    70    30    91    305     305
1     2    B     8    72     1     5     8     94      94
2     3    C    46    95    68    67    48    324     324
3     4    D    56    11     4    16     1     88      88
4     5    E    85    46    21    75    44    271     271
5     6    F    86    68    78    99    56    387     387
6     7    G    53    44    35    58    53    243     243
7     8    H    38     8    85    39    62    232     232
8     9    I    87    40     5    44    91    267     267
9    10    J    92    41    40    11    51    235     235

In [71]:
s = pd.Series(["a", None, "b"], dtype="string")
s.str.count("a")

0       1
1    <NA>
2       0
dtype: Int64

In [73]:
s.dropna().str.count("a")

0    1
2    0
dtype: Int64

In [74]:
s

0       a
1    <NA>
2       b
dtype: string

In [75]:
txt = "My name is Stle"

print(txt.encode(encoding="ascii",errors="backslashreplace"))
print(txt.encode(encoding="ascii",errors="ignore"))
print(txt.encode(encoding="ascii",errors="namereplace"))
print(txt.encode(encoding="ascii",errors="replace"))
print(txt.encode(encoding="ascii",errors="xmlcharrefreplace"))

b'My name is St\\xe5le'
b'My name is Stle'
b'My name is St\\N{LATIN SMALL LETTER A WITH RING ABOVE}le'
b'My name is St?le'
b'My name is St&#229;le'

In [77]:
dollars = pd.Series(["12", "-$10", "$10,000"], dtype="string")
dollars

0         12
1       -$10
2    $10,000
dtype: string

In [78]:
dollars.str.replace(r"-\$", "-", regex=True)

0         12
1        -10
2    $10,000
dtype: string

In [85]:
x = "women 19"
y = r'\bmen 1\b'

pd.Series(["women 19", "abd men 1 pakistan"]).str.replace(y,"", regex=True)

0         women 19
1    abd  pakistan
dtype: object

In [86]:
reg = r"\b[abc]([iv]+)\b"
s = pd.Series(["ajkdsf ak stage a1, aii, a3", "abd men 1 pakistan"])

s.replace(reg,'roman',regex=True)

0    ajkdsf ak stage a1, roman, a3
1               abd men 1 pakistan
dtype: object

In [89]:
pd.Series(
    ["a1 hello", "b2 yy", "c3","d4"],
    dtype="string",
).str.extract(r"\b([ab])(\d)\b", expand=False)

      0     1
0     a     1
1     b     2
2  <NA>  <NA>
3  <NA>  <NA>

In [101]:
df1 = pd.DataFrame({"X":np.random.randint(1,100, 1000),
                   "Y": [pd.Series(["A","B","C"]).sample(1).values[0] for i in range(1000)]
                   })
df1

      X  Y
0    37  A
1    58  B
2    23  B
3     9  C
4    59  C
..   .. ..
995  88  A
996  45  C
997  96  B
998  10  A
999   1  B

[1000 rows x 2 columns]

In [ ]:
#   A B C
#A  1 0 0
#B  0 1 0
#C  0 0 1

In [102]:
pd.get_dummies(df1.Y)

     A  B  C
0    1  0  0
1    0  1  0
2    0  1  0
3    0  0  1
4    0  0  1
..  .. .. ..
995  1  0  0
996  0  0  1
997  0  1  0
998  1  0  0
999  0  1  0

[1000 rows x 3 columns]

In [96]:
 pd.Series(["A","B","C"]).sample(1)

1    B
dtype: object

# handle null values

In [122]:
df = pd.DataFrame(
    np.random.randn(5, 3),
    index=["a", "c", "e", "f", "h"],
    columns=["one", "two", "three"],
)
df

        one       two     three
a  1.143622 -0.819672 -0.155115
c -0.097118  1.159542  0.824832
e  0.383128 -1.235158  0.982446
f  0.523330 -0.021055  0.187879
h  0.809041  0.776752  0.425965

In [123]:
df["four"] = "bar"

In [124]:
df["five"] = df["one"] > 0
df

        one       two     three four   five
a  1.143622 -0.819672 -0.155115  bar   True
c -0.097118  1.159542  0.824832  bar  False
e  0.383128 -1.235158  0.982446  bar   True
f  0.523330 -0.021055  0.187879  bar   True
h  0.809041  0.776752  0.425965  bar   True

In [125]:
df2 = df.reindex(["a", "b", "c", "d", "e", "f", "g", "h"])
df2

        one       two     three four   five
a  1.143622 -0.819672 -0.155115  bar   True
b       NaN       NaN       NaN  NaN    NaN
c -0.097118  1.159542  0.824832  bar  False
d       NaN       NaN       NaN  NaN    NaN
e  0.383128 -1.235158  0.982446  bar   True
f  0.523330 -0.021055  0.187879  bar   True
g       NaN       NaN       NaN  NaN    NaN
h  0.809041  0.776752  0.425965  bar   True

In [126]:
pd.isna(df2["one"])

a    False
b     True
c    False
d     True
e    False
f    False
g     True
h    False
Name: one, dtype: bool

In [127]:
df2["four"].notna()

a     True
b    False
c     True
d    False
e     True
f     True
g    False
h     True
Name: four, dtype: bool

In [128]:
df2.isna()

     one    two  three   four   five
a  False  False  False  False  False
b   True   True   True   True   True
c  False  False  False  False  False
d   True   True   True   True   True
e  False  False  False  False  False
f  False  False  False  False  False
g   True   True   True   True   True
h  False  False  False  False  False

In [129]:
df2["one"] == np.nan

a    False
b    False
c    False
d    False
e    False
f    False
g    False
h    False
Name: one, dtype: bool

In [130]:
df2

        one       two     three four   five
a  1.143622 -0.819672 -0.155115  bar   True
b       NaN       NaN       NaN  NaN    NaN
c -0.097118  1.159542  0.824832  bar  False
d       NaN       NaN       NaN  NaN    NaN
e  0.383128 -1.235158  0.982446  bar   True
f  0.523330 -0.021055  0.187879  bar   True
g       NaN       NaN       NaN  NaN    NaN
h  0.809041  0.776752  0.425965  bar   True

In [131]:
pd.notna(df2["one"])

a     True
b    False
c     True
d    False
e     True
f     True
g    False
h     True
Name: one, dtype: bool

In [132]:
df2.fillna(0)

        one       two     three four   five
a  1.143622 -0.819672 -0.155115  bar   True
b  0.000000  0.000000  0.000000    0      0
c -0.097118  1.159542  0.824832  bar  False
d  0.000000  0.000000  0.000000    0      0
e  0.383128 -1.235158  0.982446  bar   True
f  0.523330 -0.021055  0.187879  bar   True
g  0.000000  0.000000  0.000000    0      0
h  0.809041  0.776752  0.425965  bar   True

In [133]:
df2

        one       two     three four   five
a  1.143622 -0.819672 -0.155115  bar   True
b       NaN       NaN       NaN  NaN    NaN
c -0.097118  1.159542  0.824832  bar  False
d       NaN       NaN       NaN  NaN    NaN
e  0.383128 -1.235158  0.982446  bar   True
f  0.523330 -0.021055  0.187879  bar   True
g       NaN       NaN       NaN  NaN    NaN
h  0.809041  0.776752  0.425965  bar   True

In [135]:

df2
# df

        one       two     three four   five
a  1.143622 -0.819672 -0.155115  bar   True
b       NaN       NaN       NaN  NaN    NaN
c -0.097118  1.159542  0.824832  bar  False
d       NaN       NaN       NaN  NaN    NaN
e  0.383128 -1.235158  0.982446  bar   True
f  0.523330 -0.021055  0.187879  bar   True
g       NaN       NaN       NaN  NaN    NaN
h  0.809041  0.776752  0.425965  bar   True